{"id":"GY-006","title":"METATOWEL #IStakeMyTowel Distribution Mechanic","date_claimed":"2026-02-07","date_buried":"2026-02-27","category":"product","what_we_claimed":"Anyone who tweets #IStakeMyTowel with a conviction pick will earn METATOWEL based on attention generated. Belief is the bet. Early believers get paid out.","what_we_built":"The hashtag. Leo posted his own stake. 2 people participated, 1 returned asking about their reward, 1M TOWEL sent manually.","why_it_died":"Announced 24h before the Super Bowl. No automated hashtag tracking, no distribution script, no mechanic for measuring attention-per-tweet. Required infrastructure that didn't exist and wasn't built in time.","what_we_learned":"Non-zero meme movement — 2 participants and 1 return inquiry proves the concept has pull. The campaign showed demand. The mechanic just needed more than 24 hours and a real distribution layer. Conviction-as-signal is the right thesis; METATOWEL was the wrong vehicle.","what_lives":"story.markets as the staking surface. Season 2 launch gives 2+ days to design the mechanic properly. #StakeYourTowel campaign carries forward with real infrastructure behind it.","recommit":"story.markets staking layer — Season 2 launch"}
{"id":"GY-007","title":"METATOWEL Premature Utility Claims","date_claimed":"2026-02-07","date_buried":"2026-02-27","category":"product","what_we_claimed":"METATOWEL will have larger price and volume movement; will reward creator with more creator rewards; implied distinct mechanics differentiating it from TOWEL.","what_we_built":"The token. The launch. The separation-of-meme-and-state framing. No distinct mechanics were built beyond what pump.fun provides natively.","why_it_died":"Announced before the architecture was clear. The two-token model is right but wasn't specced until much later. Creator rewards were a platform feature, not a MetaSPN product.","what_we_learned":"The correct architecture: METATOWEL = operational cash (profits recycled into liquidity, keeps trading active), TOWEL = conviction stock (held, staked, rewarded, long-term value). Cash and stock. This is Season 2 territory — needs real profit flow before the story becomes true.","what_lives":"The two-token architecture. Season 2: first x402 revenue → first METATOWEL buy. That's when the story stops being a plan and starts being a fact.","recommit":"Season 2 — when profit flow exists to actually recycle into METATOWEL liquidity. Story first, then mechanics."}
{"id":"GY-008","title":"Profit Payout to Early Believers — Vague Mechanic","date_claimed":"2026-02-08","date_buried":"2026-02-27","category":"product","what_we_claimed":"Will pay out profits based on how early people were willing to believe in a hashtag. Early belief = larger share.","what_we_built":"1M TOWEL sent manually to one returning participant. No tracking system. No automated distribution. No profits to share (portfolio ~$12 net).","why_it_died":"Claimed on Day 0 before any profits existed. No infrastructure for timestamp-weighted distribution. No profits materialized at the scale needed.","what_we_learned":"The principle is right — reward early conviction. The implementation was vague and premature. Needs: (1) a defined revenue trigger, (2) a list of verified early stakers, (3) a specific share percentage.","what_lives":"Season 2 first profit share payout. Formal commitment written separately at clawd/commitments/season2-profit-share.md","recommit":"Season 2 launch — first MetaSPN profit share. Primary goal of Season 2."}
